logs/facebook/dsb-result_node5_threads48_conn200_mixed-workload_network_facebook-mode-numa-membind-0.log

CONFIG: node:5 threads:48 conn:200 workload:mixed-workload network:facebook RPS:1000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080
  48 threads and 200 connections

  Thread calibration: mean lat.: 21.912ms, rate sampling interval: 113ms
  Thread calibration: mean lat.: 17.922ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 22.295ms, rate sampling interval: 135ms
  Thread calibration: mean lat.: 20.951ms, rate sampling interval: 116ms
  Thread calibration: mean lat.: 19.039ms, rate sampling interval: 84ms
  Thread calibration: mean lat.: 19.314ms, rate sampling interval: 110ms
  Thread calibration: mean lat.: 21.943ms, rate sampling interval: 103ms
  Thread calibration: mean lat.: 17.827ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 18.642ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 20.197ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 19.829ms, rate sampling interval: 107ms
  Thread calibration: mean lat.: 24.188ms, rate sampling interval: 146ms
  Thread calibration: mean lat.: 19.311ms, rate sampling interval: 89ms
  Thread calibration: mean lat.: 22.007ms, rate sampling interval: 128ms
  Thread calibration: mean lat.: 19.911ms, rate sampling interval: 104ms
  Thread calibration: mean lat.: 25.432ms, rate sampling interval: 153ms
  Thread calibration: mean lat.: 21.894ms, rate sampling interval: 121ms
  Thread calibration: mean lat.: 16.869ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 21.479ms, rate sampling interval: 127ms
  Thread calibration: mean lat.: 18.633ms, rate sampling interval: 106ms
  Thread calibration: mean lat.: 20.175ms, rate sampling interval: 111ms
  Thread calibration: mean lat.: 18.366ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 17.546ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 20.090ms, rate sampling interval: 124ms
  Thread calibration: mean lat.: 21.352ms, rate sampling interval: 104ms
  Thread calibration: mean lat.: 18.848ms, rate sampling interval: 97ms
  Thread calibration: mean lat.: 22.142ms, rate sampling interval: 131ms
  Thread calibration: mean lat.: 22.155ms, rate sampling interval: 133ms
  Thread calibration: mean lat.: 24.612ms, rate sampling interval: 156ms
  Thread calibration: mean lat.: 18.537ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 23.145ms, rate sampling interval: 128ms
  Thread calibration: mean lat.: 17.421ms, rate sampling interval: 80ms
  Thread calibration: mean lat.: 18.955ms, rate sampling interval: 96ms
  Thread calibration: mean lat.: 19.097ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 19.634ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 20.258ms, rate sampling interval: 125ms
  Thread calibration: mean lat.: 21.856ms, rate sampling interval: 127ms
  Thread calibration: mean lat.: 23.394ms, rate sampling interval: 159ms
  Thread calibration: mean lat.: 19.292ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 16.337ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 19.444ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 21.204ms, rate sampling interval: 118ms
  Thread calibration: mean lat.: 23.377ms, rate sampling interval: 148ms
  Thread calibration: mean lat.: 21.213ms, rate sampling interval: 127ms
  Thread calibration: mean lat.: 22.341ms, rate sampling interval: 109ms
  Thread calibration: mean lat.: 19.219ms, rate sampling interval: 108ms
  Thread calibration: mean lat.: 20.836ms, rate sampling interval: 100ms
  Thread calibration: mean lat.: 21.849ms, rate sampling interval: 139ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.74ms   13.50ms  89.92ms   96.24%
    Req/Sec    19.80     15.89    67.00     66.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.33ms
 75.000%   12.19ms
 90.000%   15.52ms
 99.000%   89.92ms
 99.900%  135.93ms
 99.990%  179.46ms
 99.999%  239.36ms
100.000%  252.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.975     0.000000            1         1.00
       6.323     0.100000        10589         1.11
       8.447     0.200000        21252         1.25
       9.223     0.300000        31783         1.43
       9.799     0.400000        42427         1.67
      10.327     0.500000        52996         2.00
      10.607     0.550000        58269         2.22
      10.927     0.600000        63601         2.50
      11.287     0.650000        68833         2.86
      11.695     0.700000        74111         3.33
      12.191     0.750000        79433         4.00
      12.495     0.775000        82055         4.44
      12.847     0.800000        84720         5.00
      13.239     0.825000        87370         5.71
      13.759     0.850000        89971         6.67
      14.471     0.875000        92625         8.00
      14.927     0.887500        93933         8.89
      15.519     0.900000        95270        10.00
      16.223     0.912500        96587        11.43
      17.199     0.925000        97919        13.33
      18.511     0.937500        99226        16.00
      19.439     0.943750        99887        17.78
      20.575     0.950000       100549        20.00
      22.287     0.956250       101210        22.86
      26.351     0.962500       101873        26.67
      39.679     0.968750       102532        32.00
      47.743     0.971875       102865        35.56
      55.423     0.975000       103194        40.00
      62.431     0.978125       103525        45.71
      69.439     0.981250       103855        53.33
      76.223     0.984375       104191        64.00
      79.999     0.985938       104351        71.11
      83.455     0.987500       104519        80.00
      87.487     0.989062       104682        91.43
      91.583     0.990625       104849       106.67
      96.383     0.992188       105016       128.00
      98.815     0.992969       105097       142.22
     101.631     0.993750       105178       160.00
     104.383     0.994531       105261       182.86
     107.647     0.995313       105343       213.33
     111.167     0.996094       105427       256.00
     112.767     0.996484       105467       284.44
     114.623     0.996875       105509       320.00
     117.247     0.997266       105550       365.71
     120.255     0.997656       105591       426.67
     123.711     0.998047       105633       512.00
     126.015     0.998242       105654       568.89
     128.767     0.998437       105674       640.00
     131.199     0.998633       105695       731.43
     132.991     0.998828       105715       853.33
     136.703     0.999023       105736      1024.00
     138.623     0.999121       105746      1137.78
     142.463     0.999219       105757      1280.00
     144.767     0.999316       105767      1462.86
     146.943     0.999414       105777      1706.67
     151.039     0.999512       105788      2048.00
     152.703     0.999561       105793      2275.56
     154.239     0.999609       105798      2560.00
     157.311     0.999658       105803      2925.71
     161.023     0.999707       105808      3413.33
     163.455     0.999756       105814      4096.00
     167.423     0.999780       105816      4551.11
     170.879     0.999805       105819      5120.00
     172.799     0.999829       105821      5851.43
     175.743     0.999854       105824      6826.67
     179.071     0.999878       105827      8192.00
     179.455     0.999890       105828      9102.22
     186.111     0.999902       105829     10240.00
     188.543     0.999915       105830     11702.86
     202.879     0.999927       105832     13653.33
     203.263     0.999939       105833     16384.00
     204.031     0.999945       105834     18204.44
     204.031     0.999951       105834     20480.00
     215.167     0.999957       105835     23405.71
     219.775     0.999963       105836     27306.67
     219.775     0.999969       105836     32768.00
     231.423     0.999973       105837     36408.89
     231.423     0.999976       105837     40960.00
     231.423     0.999979       105837     46811.43
     239.359     0.999982       105838     54613.33
     239.359     0.999985       105838     65536.00
     239.359     0.999986       105838     72817.78
     239.359     0.999988       105838     81920.00
     239.359     0.999989       105838     93622.86
     252.671     0.999991       105839    109226.67
     252.671     1.000000       105839          inf
#[Mean    =       12.745, StdDeviation   =       13.502]
#[Max     =      252.544, Total count    =       105839]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  115322 requests in 2.00m, 1.41GB read
Requests/sec:    960.93  
Transfer/sec:     12.03MB
*************************************************************

CONFIG: node:5 threads:48 conn:200 workload:mixed-workload network:facebook RPS:5000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080
  48 threads and 200 connections

  Thread calibration: mean lat.: 6.178ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 7.036ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.425ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.979ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.305ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.887ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.291ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.553ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.996ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.602ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 7.255ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 7.003ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.748ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.377ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.739ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 7.058ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.791ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.834ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.671ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.855ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 7.579ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 6.377ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 7.088ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.834ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.024ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.983ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.370ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.664ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.815ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.835ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.216ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.896ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.311ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.698ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.620ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.029ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 5.993ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.154ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.475ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.454ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.093ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.861ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 6.926ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 6.843ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.693ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 7.186ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 7.497ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.987ms, rate sampling interval: 18ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.40ms    3.54ms  20.11ms   85.66%
    Req/Sec   106.31     70.86   300.00     73.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.47ms
 75.000%    7.49ms
 90.000%   10.39ms
 99.000%   20.11ms
 99.900%   31.73ms
 99.990%   43.17ms
 99.999%   56.42ms
100.000%   61.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.888     0.000000            1         1.00
       3.303     0.100000        55128         1.11
       3.877     0.200000       110103         1.25
       4.411     0.300000       164900         1.43
       4.923     0.400000       219898         1.67
       5.475     0.500000       275010         2.00
       5.779     0.550000       302512         2.22
       6.119     0.600000       329988         2.50
       6.499     0.650000       357275         2.86
       6.951     0.700000       384791         3.33
       7.491     0.750000       412196         4.00
       7.807     0.775000       425989         4.44
       8.163     0.800000       439659         5.00
       8.567     0.825000       453587         5.71
       9.039     0.850000       467136         6.67
       9.623     0.875000       480840         8.00
       9.983     0.887500       487751         8.89
      10.391     0.900000       494628        10.00
      10.871     0.912500       501512        11.43
      11.431     0.925000       508311        13.33
      12.135     0.937500       515204        16.00
      12.551     0.943750       518618        17.78
      13.031     0.950000       522067        20.00
      13.591     0.956250       525514        22.86
      14.239     0.962500       528938        26.67
      15.023     0.968750       532343        32.00
      15.495     0.971875       534089        35.56
      16.015     0.975000       535777        40.00
      16.607     0.978125       537510        45.71
      17.279     0.981250       539247        53.33
      18.111     0.984375       540935        64.00
      18.575     0.985938       541799        71.11
      19.103     0.987500       542656        80.00
      19.711     0.989062       543510        91.43
      20.463     0.990625       544379       106.67
      21.327     0.992188       545234       128.00
      21.855     0.992969       545668       142.22
      22.463     0.993750       546088       160.00
      23.103     0.994531       546516       182.86
      23.855     0.995313       546943       213.33
      24.687     0.996094       547368       256.00
      25.231     0.996484       547588       284.44
      25.839     0.996875       547797       320.00
      26.543     0.997266       548013       365.71
      27.311     0.997656       548227       426.67
      28.175     0.998047       548445       512.00
      28.751     0.998242       548550       568.89
      29.375     0.998437       548656       640.00
      30.031     0.998633       548763       731.43
      30.815     0.998828       548871       853.33
      31.871     0.999023       548980      1024.00
      32.383     0.999121       549032      1137.78
      32.959     0.999219       549085      1280.00
      33.759     0.999316       549140      1462.86
      34.623     0.999414       549193      1706.67
      35.551     0.999512       549247      2048.00
      36.063     0.999561       549274      2275.56
      36.575     0.999609       549300      2560.00
      37.151     0.999658       549328      2925.71
      38.079     0.999707       549354      3413.33
      38.719     0.999756       549380      4096.00
      39.167     0.999780       549394      4551.11
      39.935     0.999805       549407      5120.00
      40.671     0.999829       549421      5851.43
      41.599     0.999854       549435      6826.67
      42.239     0.999878       549447      8192.00
      42.687     0.999890       549455      9102.22
      43.391     0.999902       549461     10240.00
      43.999     0.999915       549468     11702.86
      44.767     0.999927       549476     13653.33
      45.887     0.999939       549481     16384.00
      46.239     0.999945       549484     18204.44
      46.591     0.999951       549488     20480.00
      47.199     0.999957       549491     23405.71
      47.519     0.999963       549494     27306.67
      48.639     0.999969       549498     32768.00
      49.151     0.999973       549499     36408.89
      50.815     0.999976       549501     40960.00
      51.455     0.999979       549503     46811.43
      51.583     0.999982       549504     54613.33
      52.159     0.999985       549506     65536.00
      52.447     0.999986       549507     72817.78
      52.575     0.999988       549508     81920.00
      56.415     0.999989       549509     93622.86
      56.415     0.999991       549509    109226.67
      57.183     0.999992       549510    131072.00
      57.983     0.999993       549511    145635.56
      57.983     0.999994       549511    163840.00
      58.463     0.999995       549512    187245.71
      58.463     0.999995       549512    218453.33
      58.463     0.999996       549512    262144.00
      60.095     0.999997       549513    291271.11
      60.095     0.999997       549513    327680.00
      60.095     0.999997       549513    374491.43
      60.095     0.999998       549513    436906.67
      60.095     0.999998       549513    524288.00
      61.983     0.999998       549514    582542.22
      61.983     1.000000       549514          inf
#[Mean    =        6.400, StdDeviation   =        3.538]
#[Max     =       61.952, Total count    =       549514]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  599036 requests in 2.00m, 7.33GB read
Requests/sec:   4995.27  
Transfer/sec:     62.57MB
*************************************************************

CONFIG: node:5 threads:48 conn:200 workload:mixed-workload network:facebook RPS:10000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080
  48 threads and 200 connections

  Thread calibration: mean lat.: 483.671ms, rate sampling interval: 3612ms
  Thread calibration: mean lat.: 1720.637ms, rate sampling interval: 8232ms
  Thread calibration: mean lat.: 871.912ms, rate sampling interval: 6918ms
  Thread calibration: mean lat.: 980.356ms, rate sampling interval: 5332ms
  Thread calibration: mean lat.: 733.626ms, rate sampling interval: 4489ms
  Thread calibration: mean lat.: 1684.045ms, rate sampling interval: 7901ms
  Thread calibration: mean lat.: 984.125ms, rate sampling interval: 5443ms
  Thread calibration: mean lat.: 1844.563ms, rate sampling interval: 7843ms
  Thread calibration: mean lat.: 599.677ms, rate sampling interval: 4419ms
  Thread calibration: mean lat.: 1166.039ms, rate sampling interval: 7008ms
  Thread calibration: mean lat.: 1611.515ms, rate sampling interval: 7340ms
  Thread calibration: mean lat.: 408.001ms, rate sampling interval: 2467ms
  Thread calibration: mean lat.: 474.564ms, rate sampling interval: 2003ms
  Thread calibration: mean lat.: 825.521ms, rate sampling interval: 6733ms
  Thread calibration: mean lat.: 255.885ms, rate sampling interval: 1647ms
  Thread calibration: mean lat.: 1591.498ms, rate sampling interval: 7733ms
  Thread calibration: mean lat.: 702.269ms, rate sampling interval: 6516ms
  Thread calibration: mean lat.: 567.486ms, rate sampling interval: 4093ms
  Thread calibration: mean lat.: 630.876ms, rate sampling interval: 4538ms
  Thread calibration: mean lat.: 868.074ms, rate sampling interval: 6615ms
  Thread calibration: mean lat.: 632.066ms, rate sampling interval: 4673ms
  Thread calibration: mean lat.: 553.229ms, rate sampling interval: 3055ms
  Thread calibration: mean lat.: 364.791ms, rate sampling interval: 2549ms
  Thread calibration: mean lat.: 673.030ms, rate sampling interval: 5505ms
  Thread calibration: mean lat.: 2103.780ms, rate sampling interval: 9404ms
  Thread calibration: mean lat.: 119.632ms, rate sampling interval: 707ms
  Thread calibration: mean lat.: 1680.199ms, rate sampling interval: 8699ms
  Thread calibration: mean lat.: 1000.428ms, rate sampling interval: 3739ms
  Thread calibration: mean lat.: 503.504ms, rate sampling interval: 2926ms
  Thread calibration: mean lat.: 1415.489ms, rate sampling interval: 7184ms
  Thread calibration: mean lat.: 1529.167ms, rate sampling interval: 5681ms
  Thread calibration: mean lat.: 980.127ms, rate sampling interval: 6811ms
  Thread calibration: mean lat.: 793.656ms, rate sampling interval: 6578ms
  Thread calibration: mean lat.: 1140.249ms, rate sampling interval: 6852ms
  Thread calibration: mean lat.: 1968.731ms, rate sampling interval: 8503ms
  Thread calibration: mean lat.: 1121.985ms, rate sampling interval: 5971ms
  Thread calibration: mean lat.: 1234.132ms, rate sampling interval: 7323ms
  Thread calibration: mean lat.: 778.150ms, rate sampling interval: 6647ms
  Thread calibration: mean lat.: 630.963ms, rate sampling interval: 2961ms
  Thread calibration: mean lat.: 937.679ms, rate sampling interval: 3620ms
  Thread calibration: mean lat.: 707.682ms, rate sampling interval: 4012ms
  Thread calibration: mean lat.: 483.256ms, rate sampling interval: 3272ms
  Thread calibration: mean lat.: 2432.323ms, rate sampling interval: 9846ms
  Thread calibration: mean lat.: 477.817ms, rate sampling interval: 2308ms
  Thread calibration: mean lat.: 945.838ms, rate sampling interval: 5169ms
  Thread calibration: mean lat.: 821.077ms, rate sampling interval: 5074ms
  Thread calibration: mean lat.: 1467.512ms, rate sampling interval: 8888ms
  Thread calibration: mean lat.: 682.518ms, rate sampling interval: 4497ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.70s    17.54s    1.14m    82.93%
    Req/Sec   152.25     28.72   216.00     66.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.99s 
 75.000%   27.43s 
 90.000%   42.01s 
 99.000%    1.14m 
 99.900%    1.31m 
 99.990%    1.35m 
 99.999%    1.37m 
100.000%    1.37m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.483     0.000000            1         1.00
      53.311     0.100000        73689         1.11
     378.879     0.200000       147380         1.25
    2179.071     0.300000       221113         1.43
    5853.183     0.400000       294806         1.67
   10985.471     0.500000       368473         2.00
   14614.527     0.550000       405338         2.22
   18022.399     0.600000       442118         2.50
   21118.975     0.650000       479062         2.86
   24248.319     0.700000       515943         3.33
   27426.815     0.750000       552770         4.00
   29507.583     0.775000       571121         4.44
   31555.583     0.800000       589566         5.00
   33849.343     0.825000       607905         5.71
   36241.407     0.850000       626504         6.67
   38862.847     0.875000       644871         8.00
   40304.639     0.887500       653970         8.89
   42008.575     0.900000       663328        10.00
   43646.975     0.912500       672561        11.43
   45776.895     0.925000       681675        13.33
   48627.711     0.937500       690870        16.00
   50298.879     0.943750       695427        17.78
   52363.263     0.950000       700035        20.00
   54362.111     0.956250       704648        22.86
   56295.423     0.962500       709260        26.67
   58425.343     0.968750       713880        32.00
   59506.687     0.971875       716170        35.56
   60620.799     0.975000       718451        40.00
   61702.143     0.978125       720742        45.71
   62947.327     0.981250       723059        53.33
   64356.351     0.984375       725377        64.00
   65208.319     0.985938       726498        71.11
   66256.895     0.987500       727666        80.00
   67567.615     0.989062       728797        91.43
   68878.335     0.990625       729999       106.67
   70189.055     0.992188       731146       128.00
   70844.415     0.992969       731731       142.22
   71434.239     0.993750       732284       160.00
   72089.599     0.994531       732836       182.86
   72744.959     0.995313       733454       213.33
   73531.391     0.996094       733982       256.00
   73990.143     0.996484       734286       284.44
   74383.359     0.996875       734556       320.00
   74973.183     0.997266       734837       365.71
   75759.615     0.997656       735136       426.67
   76742.655     0.998047       735414       512.00
   77135.871     0.998242       735559       568.89
   77594.623     0.998437       735703       640.00
   77987.839     0.998633       735860       731.43
   78446.591     0.998828       735994       853.33
   78839.807     0.999023       736154      1024.00
   78970.879     0.999121       736210      1137.78
   79167.487     0.999219       736285      1280.00
   79364.095     0.999316       736352      1462.86
   79560.703     0.999414       736428      1706.67
   79822.847     0.999512       736512      2048.00
   79888.383     0.999561       736542      2275.56
   80019.455     0.999609       736574      2560.00
   80150.527     0.999658       736602      2925.71
   80347.135     0.999707       736636      3413.33
   80609.279     0.999756       736683      4096.00
   80674.815     0.999780       736694      4551.11
   80805.887     0.999805       736714      5120.00
   80871.423     0.999829       736728      5851.43
   81002.495     0.999854       736750      6826.67
   81133.567     0.999878       736765      8192.00
   81199.103     0.999890       736778      9102.22
   81264.639     0.999902       736792     10240.00
   81264.639     0.999915       736792     11702.86
   81395.711     0.999927       736799     13653.33
   81526.783     0.999939       736808     16384.00
   81592.319     0.999945       736813     18204.44
   81657.855     0.999951       736815     20480.00
   81723.391     0.999957       736826     23405.71
   81723.391     0.999963       736826     27306.67
   81788.927     0.999969       736833     32768.00
   81788.927     0.999973       736833     36408.89
   81788.927     0.999976       736833     40960.00
   81854.463     0.999979       736836     46811.43
   81919.999     0.999982       736845     54613.33
   81919.999     0.999985       736845     65536.00
   81919.999     0.999986       736845     72817.78
   81919.999     0.999988       736845     81920.00
   81919.999     0.999989       736845     93622.86
   81919.999     0.999991       736845    109226.67
   81919.999     0.999992       736845    131072.00
   81919.999     0.999993       736845    145635.56
   81985.535     0.999994       736849    163840.00
   81985.535     0.999995       736849    187245.71
   81985.535     0.999995       736849    218453.33
   81985.535     0.999996       736849    262144.00
   81985.535     0.999997       736849    291271.11
   81985.535     0.999997       736849    327680.00
   81985.535     0.999997       736849    374491.43
   81985.535     0.999998       736849    436906.67
   81985.535     0.999998       736849    524288.00
   81985.535     0.999998       736849    582542.22
   81985.535     0.999998       736849    655360.00
   82051.071     0.999999       736850    748982.86
   82051.071     1.000000       736850          inf
#[Mean    =    16696.763, StdDeviation   =    17543.554]
#[Max     =    81985.536, Total count    =       736850]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  807693 requests in 2.00m, 9.88GB read
Requests/sec:   6736.45  
Transfer/sec:     84.39MB
*************************************************************